backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 1
      - 32
      - 32
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: &id002 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_3
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_3
      trainable: true
  - class_name: MaxPooling2D
    config:
      data_format: channels_first
      dtype: float32
      name: max_pooling2d_3
      padding: valid
      pool_size: &id001 !!python/tuple
      - 2
      - 2
      strides: *id001
      trainable: true
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      dtype: float32
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_4
      padding: valid
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
  - class_name: BatchNormalization
    config:
      axis: 1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_4
      trainable: true
  - class_name: MaxPooling2D
    config:
      data_format: channels_first
      dtype: float32
      name: max_pooling2d_4
      padding: valid
      pool_size: *id001
      strides: *id001
      trainable: true
  - class_name: Flatten
    config:
      data_format: channels_first
      dtype: float32
      name: flatten_2
      trainable: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 128
      use_bias: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_2
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_4
      trainable: true
      units: 36
      use_bias: true
  name: sequential_2
keras_version: 2.3.1
